tutorials/solvers/wavePlicFoam/3Dwaves/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (   0  -5    -50)
    ( 150  -5    -50)
    ( -50  -5      0)
    (   0  -5      0)
    ( 150  -5      0)
    ( 200  -5      0)
    ( -50  -5    150)
    (   0  -5    150)
    ( 150  -5    150)
    ( 200  -5    150)
    (   0  -5    200)
    ( 150  -5    200)

    (   0   5    -50)
    ( 150   5    -50)
    ( -50   5      0)
    (   0   5      0)
    ( 150   5      0)
    ( 200   5      0)
    ( -50   5    150)
    (   0   5    150)
    ( 150   5    150)
    ( 200   5    150)
    (   0   5    200)
    ( 150   5    200)
);

blocks
(
    hex (0 1 13 12 3 4 16 15) (30 10 10) simpleGrading (1 1 1)
    hex (2 3 15 14 6 7 19 18 ) (15 10 30) simpleGrading (1 1 1)
    hex (3 4 16 15 7 8 20 19 ) (30 10 30) simpleGrading (1 1 1)
    hex (4 5 17 16 8 9 21 20 ) (10 10 30) simpleGrading (1 1 1)
    hex (7 8 20 19 10 11 23 22 ) (30 10 10) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet0
    (
        (6 7 19 18)
        (6 2 14 18)
        (2 3 15 14)
    )
    patch inlet1
    (
        (3 0 12 15)
        (0 1 13 12)
        (1 4 16 13)
    )
    patch inlet2
    (
        (7 10 22 19)
        (10 11 23 22)
        (11 8 20 23)
    )
    patch outlet
    (
        (4 5 17 16)
        (5 9 21 17)
        (8 9 21 20)
    )
    wall bottom
    (
        (0 1 4 3)
        (2 3 7 6)
        (3 4 8 7)
        (4 5 9 8)
        (7 8 11 10)
    )
    patch atmos
    (
        (12 13 16 15)
        (14 15 19 18)
        (15 16 20 19)
        (16 17 21 20)
        (19 20 23 22)
    )
    patch internalWall
    ()
);

mergePatchPairs
(
);

// ************************************************************************* //
