tutorials/solvers/wavePlicFoam/3Dwaves/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly true;


// Baffles to create.
baffles
{
    internalBaffles
    {
        type        faceZone;
        zoneName    f0;

        patches
        {
            master
            {
                //- Master side patch
                name            internalWall;
                type            patch;
            }

            slave
            {
                //- Slave side patch
                name            internalWall;
                type            patch;
            }
        }
    }
}


// ************************************************************************* //
